In [1]:
import pandas as pd
dictionary = {  "NAME":["ali","veli","kenan","hilal","ayse","evren"],
                "AGE":[15,16,17,33,45,66],
                "SALARY": [100,150,240,350,110,220]
                } 
dataFrame1 = pd.DataFrame(dictionary) # Verilen bir listi (dict) kullanarak, bir veri tablosu oluşturur.
print(dataFrame1)

    NAME  AGE  SALARY
0    ali   15     100
1   veli   16     150
2  kenan   17     240
3  hilal   33     350
4   ayse   45     110
5  evren   66     220

In [2]:
# Age sütunundaki verileri 2 katını list_comp adındaki sütuna ekle ve o sütunu tabloya ekle.
dataFrame1["list_comp"] = [ each*2 for each in dataFrame1.AGE]
dataFrame1

    NAME  AGE  SALARY  list_comp
0    ali   15     100         30
1   veli   16     150         32
2  kenan   17     240         34
3  hilal   33     350         66
4   ayse   45     110         90
5  evren   66     220        132

> Bu işlemi transforming data başlığı altında apply methodunu kullanarak da yapabiliriz.

In [3]:
def multiply(age):
    return age*2

In [4]:
dataFrame1["method_apply"] = dataFrame1.AGE.apply(multiply)
dataFrame1

    NAME  AGE  SALARY  list_comp  method_apply
0    ali   15     100         30            30
1   veli   16     150         32            32
2  kenan   17     240         34            34
3  hilal   33     350         66            66
4   ayse   45     110         90            90
5  evren   66     220        132           132